000010*
000020* This is a test Program used to demonstrate cbl-grep capabilities.
      *
      * Try the following queries:
      * cbl-grep -qf=QUERY-EXAMPLES.txt:DDnoPICclause1   example.cbl
      * cbl-grep -qf=QUERY-EXAMPLES.txt:DDhasValueClause example.cbl
      * cbl-grep -qf=QUERY-EXAMPLES.txt:TableRefIndexPlusMinusOrMinusPlus example.cbl
000040*
000050 IDENTIFICATION DIVISION.
000060 PROGRAM-ID. SAMPROG.

000080 ENVIRONMENT DIVISION.
000090 CONFIGURATION SECTION.
000100 SPECIAL-NAMES.
000120 INPUT-OUTPUT SECTION.
000130 FILE-CONTROL.
000140     SELECT WORK-FILE
000150     ACCESS MODE IS SEQUENTIAL
000160     ASSIGN TO WFILE-NAME.

000180 DATA DIVISION.
000190 FILE SECTION.
000200 FD  WORK-FILE
000210     LABEL RECORDS ARE STANDARD
000230     BLOCK CONTAINS 0 RECORDS.
000240 01  WORK-RECORD              PIC X(80).

000260 WORKING-STORAGE SECTION.
000280 01  MSG                      PIC X(80) VALUE 'SAMPPROG'.
000310 01  SYNC-GROUP               SYNC.
000320     03 WFILE-NAME            PIC X(30) VALUE "file.out".
000330     03 NUM-FIELD             PIC 9(4) COMP.
000350 01  RES-WORDS.
000360     03 SORT-STATUS           PIC 9(2).
000370     03 TRANS                 PIC X(10) VALUE 'trn-id-1'.
000380     03 SUFFIX                PIC X.
000390 01  CDATE                    PIC X(8).
000400 01  CTIME                    PIC X(8).

       01  ARR1.
           03 ARR2 OCCURS 10 TIMES PIC 9(5).
       01  IX PIC 9(5) BINARY VALUE 2.

000260 LINKAGE SECTION.
000280 01  MSGL                     PIC X(80) VALUE 'SAMPPROG   '.
000300* Sync clauses are moved down.
000310 01  SYNC-GROUP               SYNC.
000320     03 WFILE-NAME-L          PIC X(30) VALUE "file.out".
000330     03 NUM-FIELD             PIC 9(4) COMP.
000350 01  RES-WORDS-L.
000360     03 SORT-STATUS           PIC 9(2).
000370     03 TRANS                 PIC X(10) VALUE 'trn-id-1'.
000380     03 SUFFIX                PIC X.

000420*
000430****************************************************************
000440*
000450 PROCEDURE DIVISION.
000460 INIT-DATE.
000470     OPEN OUTPUT WORK-FILE.
000490     DISPLAY TRANS OF RES-WORDS.
000500     MOVE ALL "A" TO WORK-RECORD.
000520     WRITE WORK-RECORD.
000530     CLOSE WORK-FILE.
           INSPECT MSGL CONVERTING SPACES TO ZEROS.
000540     DISPLAY MSG.
000570     MOVE CURRENT-DATE TO CDATE.
000580     MOVE TIME-OF-DAY TO CTIME.
000590     DISPLAY " Date: " CDATE
000600             " Time: " CTIME.
047650     COMPUTE ARR2 (IX - -1) 
047660           = ARR2 (IX + -1).
000610     GOBACK.
